package com.zzq.my.jetpacks.common.net.base

 /*
   * ================================================
   * 描述：IBaseResponse  定义相应的数据接口
   * 作者：zhuangzeqin
   * 时间: 2021/5/25-15:27
   * 邮箱：zzq@eeepay.cn
   * 备注:
   * ----------------------------------------------------------------
   * You never know what you can do until you try !
   *      _              _           _     _   ____  _             _ _
   *     / \   _ __   __| |_ __ ___ (_) __| | / ___|| |_ _   _  __| (_) ___
   *    / _ \ | '_ \ / _` | '__/ _ \| |/ _` | \___ \| __| | | |/ _` | |/ _ \
   *   / ___ \| | | | (_| | | | (_) | | (_| |  ___) | |_| |_| | (_| | | (_) |
   *  /_/   \_\_| |_|\__,_|_|  \___/|_|\__,_| |____/ \__|\__,_|\__,_|_|\___/
   *
   * 签名：最痛苦的事不是我失败了，而是我本可以.--zzq
   * ----------------------------------------------------------------
   * ================================================
   */
interface IBaseResponse<T> {
    /**
     * 请求响应码
     */
    fun code(): Int

    /**
     * 请求提示msg
     */
    fun msg(): String

    /**
     * 请求响应数据
     */
    fun data(): T

    /**
     * 是否请求成功
     */
    fun isSuccess(): Boolean

    /**
     * 请求响应数据数量
     */
    fun count(): Int
}